import styled from "styled-components/native";
import fonts from "../styles/fonts";

const Norm = styled(fonts.Body2R)`
`;
const Bold = styled(fonts.H4SB)``;
const DoubleBold = styled(fonts.H3)``;

export const firstTerm = () => {
  return (
    <Norm>
      <Bold>제1조 (목적)</Bold>
      {"\n"}
      {"\n"}
      1. 본 약관은 사자의채소밭이 운영하는 샐러리앱(이하, ‘본 앱’이라고 함)을
      이용할 때는 이 샐러리앱의 이용규약(이하, ‘본 규약’이라고 함)에 동의한 후에
      본 앱을 다운로드 받고, 본 규약을 준수해야 합니다. 본 규약은 본 앱을
      이용하는 분들(이하, ‘이용자’라고 함)이 본 앱을 이용할 때 적용됩니다. 만약
      동의하실 수 없다면 대단히 죄송하지만 이용을 삼가 주십시오.
      {"\n"}
      {"\n"}
      2. 본규약 및 당사가 본 앱에 관해 본 앱상에 게시하거나 직접 이용자에게
      개별적으로 연락하는 알림 등은 모두 본 규약과 통합된 것으로서 이용자는 이를
      준수할 의무를 지닙니다.
      {"\n"}
      {"\n"}
      <Bold>제2조 (용어의 정의)</Bold> ① 이 약관에서 사용하는 용어의 정의는
      다음과 같습니다.
      {"\n"}{"\n"}
      1. “서비스”라 함은 구현되는 PC, 모바일 기기를 통하여 “이용자”가 이용할 수
      있는 보장분석서비스 등 회사가 제공하는 제반 서비스를 의미합니다.{"\n"}{"\n"}2.
      “이용자”란 “APP”에 접속하여 이 약관에 따라 “APP”이 제공하는 서비스를 받는
      회원 및 비회원을 말합니다. {"\n"}{"\n"}3. “회원”이란 “APP”에 개인정보를 제공하여
      회원등록을 한 자로서, “APP”이 제공하는 서비스를 이용하는 자를 말합니다. {"\n"}{"\n"}4.
      “모바일 기기”란 콘텐츠를 다운로드 받거나 설치하여 사용할 수 있는 기기로서,
      휴대폰, 스마트폰, 휴대정보단말기(PDA), 태블릿 등을 의미합니다. {"\n"}{"\n"}5.
      “계정정보”란 회원의 회원번호와 기기정보 등 회원이 회사에 제공한 정보를
      의미합니다. {"\n"}{"\n"}6. “애플리케이션”이란 회사가 제공하는 서비스를 이용하기 위하여
      모바일 기기를 통해 다운로드 받거나 설치하여 사용하는 프로그램 일체를
      의미합니다.
      {"\n"}{"\n"}② 이 약관에서 사용하는 용어의 정의는 본 조 제1항에서 정하는 것을
      제외하고는 관계법령 및 서비스별 정책에서 정하는 바에 의하며, 이에 정하지
      아니한 것은 일반적인 상 관례에 따릅니다.
      {"\n"}{"\n"}
      <Bold>제3조 (약관의 효력 및 변경)</Bold> {"\n"}{"\n"}① 본 약관은“APP” 내 또는 그
      연결화면에 게시하거나 이용자에게 공지함으로써 효력이 발생합니다.
      {"\n"}{"\n"}② 회사는 불가피한 여건이나 사정이 있을 경우 「약관의 규제에 관한
      법률」, 「정보통신망이용촉진 및 정보보호 등에 관한 법률」등 관련 법령에
      위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
      {"\n"}{"\n"}③ 회사가 약관을 개정할 경우에는 적용일자 및 개정내용, 개정사유 등을
      명시하여 최소한 그 적용일 7일 이전부터 “APP” 내 또는 그 연결화면에
      게시하여 이용자에게 공지합니다. 다만, 변경된 내용이 회원에게 불리하거나
      중대한 사항의 변경인 경우에는 그 적용일 30일 이전까지 본문과 같은 방법으로
      공지하고, 회원의 전자우편주소, 전자메모, 서비스 내 쪽지,
      문자메시지(LMS/SMS)의 방법으로 회원에게 통지합니다. 이 경우 개정 전 내용과
      개정 후 내용을 명확하게 비교하여 회원이 알기 쉽도록 표시합니다.
      {"\n"}{"\n"}④ 회사가 약관을 개정할 경우 개정약관 공지 후 개정약관의 적용에 대한
      회원의 동의 여부를 확인합니다. 회사는 제3항의 공지 또는 통지를 할 경우
      회원이 개정약관에 대해 동의 또는 거부의 의사표시를 하지 않으면 동의한
      것으로 볼 수 있다는 내용도 함께 공지 또는 통지를 하며, 회원이 이 약관
      시행일까지 거부의 의사표시를 하지 않는다면 개정약관에 동의한 것으로 볼 수
      있습니다. 회원이 개정약관에 대해 동의하지 않는 경우 회사 또는 회원은
      서비스 이용계약을 해지할 수 있습니다.
      {"\n"}{"\n"}
      <Bold>제4조 (약관 외 준칙)</Bold> {"\n"}{"\n"}이 약관에서 정하지 아니한 사항과 이
      약관의 해석에 관하여는 「약관의 규제에 관한 법률」, 「정보통신망이용촉진
      및 정보보호 등에 관한 법률」등 관련 법령 또는 상 관례에 따릅니다.
      {"\n"}{"\n"}
      <Bold>제5조 (회원가입)</Bold> {"\n"}{"\n"}① 이용자는 “APP”에서 정한 양식에 따라
      회원정보를 기입한 후 이 약관의 내용에 대하여 동의하여 회원가입 신청을
      하면, 회사가 이러한 신청을 승낙하여 회원으로 가입됩니다.
      {"\n"}{"\n"}② 회사는 원칙적으로 전 항에 따라 회원가입신청에 대하여 승낙함을
      원칙으로 합니다. 다만, 회사는 다음 각 호의 어느 하나에 해당하는 이용자에
      대해서는 회원가입을 거절하거나 사후에 회원자격을 상실시킬 수 있습니다.
      {"\n"}{"\n"}
      1. 회원정보 내용을 허위로 기재하거나 타인의 명의를 도용한 경우 {"\n"}{"\n"}2. 회사가
      서비스를 제공하지 않은 국가에서 비정상적이거나 우회적인 방법을 통해
      서비스를 이용하는 경우 {"\n"}{"\n"}3. 사회의 안녕과 질서 또는 미풍양속을 저해할
      목적으로 신청한 경우 {"\n"}{"\n"}4. 부정한 용도로 서비스를 이용하고자 하는 경우 {"\n"}{"\n"}5.
      영리를 추구할 목적으로 서비스를 이용하고자 하는 경우 {"\n"}{"\n"}6. 가입 신청자가 본
      약관에 의거 이전에 회원자격을 상실한 적이 있는 경우 {"\n"}{"\n"}7. 만 14세 미만인 경우
      {"\n"}{"\n"}8. 그 밖에 각 호에 준하는 사유로서 승낙이 부적절하다고 판단되는 경우
      {"\n"}{"\n"}③ 회원은 가입시 등록한 회원정보의 변경이 발생한 경우, 즉시 “APP”에서
      직접 수정 또는 전자우편, 기타 방법으로 회사에 그 변경 사실을 알려야
      합니다.
      {"\n"}{"\n"}
      <Bold>제6조 (회원탈퇴 및 자격상실)</Bold> {"\n"}{"\n"}① 회원은 언제든지 서비스 이용을
      원하지 않는 경우 언제든지 탈퇴를 요청할 수 있으며, 이 경우 회사는 즉시
      회원탈퇴를 처리합니다. 회원탈퇴로 인해 회원이 서비스 내에서 보유한
      이용정보는 모두 삭제되어 복구가 불가능하게 됩니다.
      {"\n"}{"\n"}② 회사는 회원이 이 약관이 금지하거나 공서양속에 반하는 행위를 하는
      등 본 계약을 유지할 수 없는 중대한 사유가 있는 경우에는 회원에게 통지하고,
      서비스 이용을 제한․중지하거나 회원 자격을 상실시킬 수 있습니다.
      {"\n"}{"\n"}③ 회사가 회원자격을 상실시키는 경우에는 회원 등록을 말소합니다. 이
      경우 회원에게 이를 통지하고, 회원 등록 말소 전에 소명할 기회를 부여합니다.
      {"\n"}{"\n"}④ 회사는 최근의 서비스 이용일부터 연속하여 1년 동안 회사의 서비스를
      이용하지 않은 회원(이하 “휴면계정”이라 합니다)의 개인정보를 보호하기 위해
      이용계약을 정지 또는 해지하고 회원의 개인정보를 분리보관 또는 파기 등의
      조치를 취할 수 있습니다. 이 경우 조치일 30일 전까지 계약 정지 또는 해지,
      개인정보 분리보관 또는 파기 등의 조치가 취해진다는 사실 및 파기될 개인정보
      등을 회원에게 통지합니다.
      {"\n"}{"\n"}
      <Bold>제7조 (회원에 대한 통지)</Bold> {"\n"}{"\n"}① 회사가 회원에 대한 통지를 하는
      경우, 회원이 회사에 제출한 전자우편 또는 휴대번호로 할 수 있다.
      {"\n"}{"\n"}② 회사는 불특정다수 회원에 대한 통지의 경우 30일 이상 “APP”에
      게시함으로서 개별 통지에 갈음 할 수 있다.
      {"\n"}{"\n"}
      <Bold>제8조 (회사의 의무)</Bold> {"\n"}{"\n"}① 회사는 관련 법령, 이 약관에서 정하는
      권리의 행사 및 의무의 이행을 신의에 따라 성실하게 준수합니다.
      {"\n"}{"\n"}② 회사는 회원이 안전하게 서비스를 이용할 수 있도록 개인정보(신용정보
      포함)보호를 위해 보안시스템을 갖추어야 하며 개인정보처리방침을 공시하고
      준수합니다. 회사는 이 약관 및 개인정보처리방침에서 정한 경우를 제외하고는
      회원의 개인정보가 제3자에게 공개 또는 제공되지 않도록 합니다.
      {"\n"}{"\n"}③ 회사는 계속적이고 안정적인 서비스의 제공을 위하여 서비스 개선을
      하던 중 설비에 장애가 생기거나 데이터 등이 멸실․훼손된 때에는 천재지변,
      비상사태, 현재의 기술로는 해결이 불가능한 장애나 결함 등 부득이한 사유가
      없는 한 지체 없이 이를 수리 또는 복구하도록 최선의 노력을 다합니다.
      {"\n"}{"\n"}
      <Bold>제9조 (회원의 의무)</Bold> {"\n"}{"\n"}① 회원은 회사에서 제공하는 서비스의
      이용과 관련하여 다음 각 호에 해당하는 행위를 해서는 안 됩니다.
      {"\n"}{"\n"}
      1. 이용신청 또는 회원 정보 변경 시 타인의 명의를 도용하거나 허위사실을
      기재하는 행위 {"\n"}{"\n"}2. 회사의 직원이나 운영자를 가장하거나 타인의 명의를
      도용하여 메일을 발송하는 행위, 타인으로 가장하거나 타인과의 관계를 허위로
      명시하는 행위 {"\n"}{"\n"}3. 다른 회원의 개인정보를 무단으로 수집⋅저장⋅게시 또는
      유포하는 행위 {"\n"}{"\n"}4. 서비스를 무단으로 영리, 영업, 광고, 홍보, 정치활동,
      선거운동 등 본래의 용도 이외의 용도로 이용하는 행위 {"\n"}{"\n"}5. 회사의 서비스를
      이용하여 얻은 정보를 무단으로 복제․유통․조장하거나 상업적으로 이용하는
      행위, 알려지거나 알려지지 않은 버그를 악용하여 서비스를 이용하는 행위 {"\n"}{"\n"}6.
      타인을 기망하여 이득을 취하는 행위, 회사의 서비스의 이용과 관련하여
      타인에게 피해를 입히는 행위 {"\n"}{"\n"}7. 회사나 타인의 지적재산권 또는 초상권을
      침해하는 행위, 타인의 명예를 훼손하거나 손해를 가하는 행위 {"\n"}{"\n"}8. 법령에
      의하여 전송 또는 게시가 금지된 정보(컴퓨터 프로그램)나 컴퓨터
      소프트웨어⋅하드웨어 또는 전기통신장비의 정상적인 작동을 방해⋅파괴할
      목적으로 고안된 바이러스⋅컴퓨터 코드⋅파일⋅프로그램 등을 고의로
      전송⋅게시⋅유포 또는 사용하는 행위 {"\n"}{"\n"}9. 회사로부터 특별한 권리를 부여받지
      않고 애플리케이션을 변경하거나, 애플리케이션에 다른 프로그램을
      추가⋅삽입하거나, 서버를 해킹⋅역설계하거나, 소스 코드나 애플리케이션
      데이터를 유출⋅변경하거나, 별도의 서버를 구축하거나, 웹사이트의 일부분을
      임의로 변경⋅도용하여 회사를 사칭하는 행위 {"\n"}{"\n"}10. 그 밖에 관련 법령에
      위반되거나 선량한 풍속 기타 사회통념에 반하는 행위
      {"\n"}{"\n"}② 회원의 ID와 비밀번호에 관한 관리책임은 회원에게 있으며, 이를
      제3자가 이용하도록 하여서는 안됩니다.
      {"\n"}{"\n"}③ 이용자는 본 약관 및 관련법령에 규정한 사항을 준수하여야 합니다.
      {"\n"}{"\n"}
      <Bold>제10조 (서비스의 이용)</Bold> {"\n"}{"\n"}① “APP”은 다음과 같은 서비스를
      회원에게 제공합니다. 단, 회사가“APP”으로 제공하는 서비스 이용을 위해
      필요시 이용자에게 위치정보이용약관 및 “계정정보”의 제공에 관한 동의를
      추가로 요구할 수 있으며, 동의하지 않을 경우 보험계약 조회 등 일부 서비스가
      제한될 수 있습니다.
      {"\n"}{"\n"}
      1. 금융/경제 용어 학습 서비스 {"\n"}{"\n"}2. 금융, 경제 등 컨텐츠 제공 {"\n"}{"\n"}3. 기타 회사가
      정하는 서비스
      {"\n"}{"\n"}② 회사는 회원에게 별도의 동의를 받은 경우 서비스 이용에 대한 유용한
      각종 정보에 대하여 “APP”에 게재하는 것 이외에 문자메시지, 푸시(Push) 알림
      등의 방법으로 회원에게 제공할 수 있습니다.
      {"\n"}{"\n"}③ 서비스의 이용은 “APP”의 업무상 또는 기술상 특별한 지장이 없는 한
      연중무휴를 원칙으로 합니다. 다만, 정기점검 등의 필요로 인하여 회사가 정한
      날 및 시간에 대해서는 예외로 합니다.
      {"\n"}{"\n"}④ 회사는 “APP” 시스템 등의 보수, 점검, 교체, 시스템의 고장, 통신의
      두절, 기타 불가항력적 사유가 발생한 경우에는 서비스의 제공을 일시적으로
      중단할 수 있습니다. 다만, 서비스 중단의 경우 회사는 “APP”에 사전 통지하고,
      사전에 통지할 수 없는 부득이한 사유가 있는 경우 제 조에 정한 방법으로
      회원에게 통지합니다.
      {"\n"}{"\n"}
      <Bold>제11조 (개인정보의 보호 및 사용)</Bold> {"\n"}{"\n"}① 회사는 이용자의 정보
      수집시 원활한 서비스 제공을 위해 필요한 최소한의 정보를 수집합니다.
      {"\n"}{"\n"}② 회사가 이용자의 개인식별이 가능한 개인정보 및 계정정보를 수집하는
      때에는 반드시 당해 이용자의 동의를 받습니다.
      {"\n"}{"\n"}③ 회사는 관련 법령에 의하거나, 관련 국가기관 등의 요청이 있는 경우를
      제외하고는 회원의 개인정보를 본인의 동의 없이 타인에게 제공하지 않습니다.
      {"\n"}{"\n"}④ 이용자는 언제든지 회사가 가지고 있는 자신의 개인정보에 대해 열람
      및 오류정정 또는 동의 철회를 요구할 수 있으며 회사는 이에 대해 지체 없이
      필요한 조치를 취할 의무를 집니다. 이용자가 오류의 정정을 요구한 경우에는
      그 오류를 정정할 때까지 해당 개인정보를 이용하지 않습니다.
      {"\n"}{"\n"}⑤ 기타 개인정보관련사항은 “APP”에 별도로 게시하는 개인정보취급방침에
      의거합니다.
      {"\n"}{"\n"}
      <Bold>제12조 (회사의 면책)</Bold> {"\n"}{"\n"}① 회사는 이 약관 제10조 제3항, 제4항의
      사유로 서비스 제공이 일시적으로 중단됨으로 인하여 이용자 또는 제3자가 입은
      손해에 대해서는 관련법에 특별한 규정이 없는 한 회원에게 별도의 보상을 하지
      않습니다.
      {"\n"}{"\n"}② 회사는 회원의 고의 또는 과실로 인한 서비스 이용의 장애에 대하여는
      책임을 지지 않습니다.
      {"\n"}{"\n"}③ 서비스와 관련하여 게재한 정보나 자료 등의 신뢰성, 정확성 등에
      대하여 회사는 고의 또는 중대한 과실이 없는 한 책임을 지지 않습니다.
      {"\n"}{"\n"}④ 회사는 무료로 제공되는 서비스 이용과 관련하여 회원에게 발생한
      손해에 대해서는 책임을 지지 않습니다.
      {"\n"}{"\n"}⑤ 회사는 회원이 서비스를 이용하여 기대하는 이익을 얻지 못하거나
      상실한 것에 대하여 책임을 지지 않습니다.
      {"\n"}{"\n"}⑥ 회사는 회원이 “APP”아이디 및 비밀번호, 모바일 기기 비밀번호,
      계정정보 등을 관리하지 않아 발생하는 손해에 대해 책임을 지지 않습니다.
      {"\n"}{"\n"}⑦ 회원이 모바일 기기의 변경, 모바일 기기의 번호 변경, 운영체제(OS)
      버전의 변경, 해외 로밍, 통신사 변경 등으로 인해 콘텐츠 전부나 일부의
      기능을 이용할 수 없는 경우 회사는 이에 대해 책임을 지지 않습니다.
      {"\n"}{"\n"}⑧ 회원이 회사가 제공하는 콘텐츠나 계정정보를 삭제한 경우 회사는 이에
      대해 책임을 지지 않습니다.
      {"\n"}{"\n"}
      <Bold>제13조 (저작권 등의 귀속)</Bold> {"\n"}{"\n"}① 회사가 제작한 서비스 내의
      콘텐츠에 대한 저작권과 기타 지적재산권은 회사에 귀속합니다.
      {"\n"}{"\n"}② 회원은 회사가 제공하는 서비스를 이용하여 얻은 정보 중에서 회사
      또는 제공업체에 지적재산권이 귀속된 정보를 회사 또는 제공업체의 사전 동의
      없이 복제⋅전송 등의 방법(편집, 공표, 공연, 배포, 방송, 2차적 저작물 작성
      등을 포함합니다. 이하 같습니다)에 의하여 영리목적으로 이용하거나 타인에게
      이용하게 하여서는 안 됩니다.
      {"\n"}{"\n"}③ 회원의 게시물이 정보통신망법 및 저작권법 등 관련법에 위반되는
      내용을 포함하는 경우, 권리자는 관련법이 정한 절차에 따라 해당 게시물의
      게시중단 및 삭제 등을 요청할 수 있으며, 이로 인해 발생하는 민·형사상의
      책임은 전적으로 해당 회원 본인이 부담하여야 하며, 회사는 관련법에 따라
      조치를 취하여야 합니다
      {"\n"}{"\n"}④ 회사는 전항에 따른 권리자의 요청이 없는 경우라도 권리침해가 인정될
      만한 사유가 있거나 기타 회사 정책 및 관련법에 위반되는 경우에는 관련법에
      따라 해당 게시물에 대해 임시조치 등을 취할 수 있습니다.
      {"\n"}{"\n"}⑤ 이 조는 회사가 서비스를 운영하는 동안 유효하며, 회원 탈퇴 후에도
      지속적으로 적용됩니다.
      {"\n"}{"\n"}
      <Bold>제14조 (회원의 고충처리 및 분쟁해결)</Bold>
      {"\n"}{"\n"}① 회사는 회원의 편의를 고려하여 회원의 의견이나 불만을 제시하는
      방법을 서비스 내 또는 그 연결화면에 안내합니다.
      {"\n"}{"\n"}② 회사는 회원으로부터 제기되는 의견이나 불만이 정당하다고 객관적으로
      인정될 경우에는 합리적인 기간 내에 이를 신속하게 처리합니다. 다만, 처리에
      장기간이 소요되는 경우에는 회원에게 장기간이 소요되는 사유와 처리일정을
      서비스 내 공지하거나 제8조에 따라 통지합니다.
      {"\n"}{"\n"}
      <Bold>제15조 (재판권 및 준거법)</Bold> {"\n"}{"\n"}이 약관은 대한민국 법률에 따라
      규율되고 해석됩니다. 회사와 회원 간에 발생한 분쟁으로 소송이 제기되는
      경우에는 법령에 정한 절차에 따른 법원을 관할 법원으로 합니다.{"\n"}{"\n"}
    </Norm>
  );
};

export const secondTerm = () => {
  return (
    <Norm>{"\n"}
      <DoubleBold>개인(신용)정보 수집 및 이용동의</DoubleBold>
      {"\n"}{"\n"}
      로그인서비스, 회원만을 위한 컨텐츠 제공 등 위해 필요한 최소한의 개인정보를
      수집하고 있습니다. 이에 개인정보의 수집 및 이용에 관하여 아래와 같이
      고지하오니 충분히 읽어보신 후 동의하여 주시기 바랍니다.
      {"\n"}{"\n"}
      <Bold>1. 수집 및 이용목적</Bold>
      {"\n"}{"\n"}
      ·APP 회원가입, 서비스 이용시 본인의 확인
      {"\n"}{"\n"}
      ·각종고지 · 통지, 고충처리, 분쟁조정을 위한 기록 보존
      {"\n"}{"\n"}
      <Bold>2. 수집 및 이용하는 개인정보 항목</Bold>
      {"\n"}{"\n"}- APP 회원가입
      {"\n"}{"\n"}
      ·성명, 생년월일, 연락처
      {"\n"}{"\n"}- APP 서비스 관련
      {"\n"}{"\n"}
      ·APP 접속 정보 및 서비스 이용정보
      {"\n"}{"\n"}
      <Bold>3. 수집방법</Bold>
      {"\n"}{"\n"}
      ·실명확인을 위하여 마련된 핸드폰에 직접 입력하는 방식
      {"\n"}{"\n"}
      ·APP에 마련된 회원가입란 및 정보 입력란에 회원 본인이 직접 입력하는 방식
      {"\n"}{"\n"}
      ·생성정보 수집 툴을 통한 수집
      {"\n"}{"\n"}
      <Bold>4. 보유 및 이용기간</Bold>
      {"\n"}{"\n"}
      이용자가 회원탈회를 요청하거나 개인정보의 수집·이용 등에 대한 동의를
      철회할 때까지 보유·이용합니다. 다만, 다음의 정보에 대해서는 아래의 이유로
      예외로 합니다.
      {"\n"}{"\n"}
      ·기타 법률에 의해 이용자의 개인정보를 보존해야 할 필요가 있는 경우에는
      해당 법률의 규정에 따릅니다.
      {"\n"}{"\n"}
      ·정보통신망 이용촉진 및 정보보 등에 관한 법률에 따라 APP을 대통령령으로
      정하는 기간동안 로그인하지 아니하는 이용자의 개인정보를 보호하기 위하여
      개인정보 파기 등 필요한 조치를 취합니다. APP 회원은 1년간 미로그인시
      회원정보 삭제 또는 분리보관 및 탈퇴 또는 이용정지처리가 됩니다. 이용자의
      요청에 따라 달리 정한 경우가 있을 경우, 달리 정한 기간을 적용할 수
      있습니다.
      {"\n"}{"\n"}
    </Norm>
  );
};

export const thirdTerm = () => {
  return (
    <Norm>{"\n"}{"\n"}
      <DoubleBold>제 1 조 (목적)</DoubleBold>
      {"\n"}{"\n"}본 약관은 사자의채소밭(이하 “회사”)이 제공하는 샐러리 APP PUSH
      서비스를 이용함에 있어 회사와 이용고객(이하 “고객”)간의 권리와 의무 및
      기타 필요한 사항을 규정하는데 그 목적이 있습니다.
      {"\n"}{"\n"}
      <DoubleBold>제 2 조 (용어 정의)</DoubleBold>
      {"\n"}{"\n"}본 약관에서 사용하는 용어의 정의는 다음과 같습니다.
      {"\n"}{"\n"}① “APP PUSH”라 함은 고객이 별도의 앱 푸시 발송 시스템의 구축 없이
      회사가 제공하는 콘솔과 SDK, API를 이용하여 고객이 원하는 대상자에게 앱
      푸시 메시지를 발송하도록 해주는 제반 서비스를 말합니다.
      {"\n"}{"\n"}② “메시지”라 함은 고객이 회사의 APP PUSH 서비스를 통해 발송하는
      모바일 앱 푸시 알림을 말합니다.
      {"\n"}{"\n"}③ “스팸”이라 함은 정보통신망 이용촉진 및 정보보호 등에 관한
      법률(이하 “정보통신망법”)을 위반하여 수신자의사전 동의를 받지 않고
      정보통신망을 통해 일방적으로 전송 또는 게시되는 영리목적의 광고성 정보를
      말합니다.
      {"\n"}{"\n"}
      <DoubleBold>제 3 조 (이용계약의 신청 및 체결)</DoubleBold>
      {"\n"}{"\n"}① APP PUSH 서비스를 이용하고자 하는 자(이하 ‘서비스이용신청자’)가
      회사가 정한 양식에 필수 입력사항을 기재한 후, 본 약관 동의 및 이용신청을
      하고 회사가 이를 승낙함으로써 메시징 서비스에 대한 이용계약이 성립합니다.
      {"\n"}{"\n"}
      <DoubleBold>제 4 조 (서비스의 제공)</DoubleBold>
      {"\n"}{"\n"}① 회사는 고객에게 아래와 같은 서비스를 제공합니다.
      {"\n"}{"\n"}
      1. 모바일 앱 푸시 알림 (대량) 발송 서비스{"\n"}
      2. 기타 회사가 추가 개발하거나 다른 회사와의 제휴계약 등을 통해 고객에게
      제공할 일체의 서비스
      {"\n"}{"\n"}② 제1항의 각 서비스의 내용은 변경될 수 있으며, 이 경우 회사는 본
      앱에 공지하거나 고객이 등록한 전자우편으로 통지합니다. 다만, 고객의 권리,
      의무에 불리한 영향을 주는 변경에 대한 통지일 경우에는 전자우편과 더불어
      고객이 등록한 휴대전화번호에 대한 휴대전화문자(SMS) 발송 또는 이와 유사한
      방법으로 추가적으로 통지합니다.
      {"\n"}{"\n"}
      <DoubleBold>제 5 조 (회사의 의무)</DoubleBold>
      {"\n"}{"\n"}① 회사는 APP PUSH 서비스를 통해 축적된 데이터를 고객 동의 없이
      외부에 제공하거나 공개하지 않습니다. 다만, 관계법령에 의한 수사상의
      목적으로 관계기관으로부터 요청받은 경우는 예외로 합니다.
      {"\n"}{"\n"}
      <DoubleBold>제 6 조 (고객의 의무)</DoubleBold>
      {"\n"}{"\n"}① 고객은 본 약관 및 전기통신관련법령, 정보통신망 이용촉진 및
      정보보호 등에 관한 법률 등 관계 법률에서 규정한 모든 사항을 준수하여야
      합니다.
      {"\n"}{"\n"}② 고객은 ‘정보통신망법 제 44조의7’ 규정에 따라 다음 각 호의 내용을
      발송하여서는 안됩니다.
      {"\n"}{"\n"}
      1. 음란한 부호ㆍ문언ㆍ음향ㆍ화상 또는 영상을 배포ㆍ판매ㆍ임대하거나
      공공연하게 전시하는 내용의 정보 {"\n"}{"\n"}2. 사람을 비방할 목적으로 공공연하게
      사실이나 거짓의 사실을 드러내어 타인의 명예를 훼손하는 내용의 정보 {"\n"}{"\n"}3.
      공포심이나 불안감을 유발하는 부호ㆍ문언ㆍ음향ㆍ화상 또는 영상을 반복적으로
      상대방에게 도달하도록 하는 내용의 정보 {"\n"}{"\n"}4. 정당한 사유 없이 정보통신시스템,
      데이터 또는 프로그램 등을 훼손ㆍ멸실ㆍ변경ㆍ위조하거나 그 운용을 방해하는
      내용의 정보 {"\n"}{"\n"}5. 「청소년 보호법」에 따른 청소년유해매체물로서 상대방의 연령
      확인, 표시의무 등 법령에 따른 의무를 이행하지 아니하고 영리를 목적으로
      제공하는 내용의 정보 {"\n"}{"\n"}6. 법령에 따라 금지되는 사행행위에 해당하는 내용의
      정보 6의2. 이 법 또는 개인정보 보호에 관한 법령을 위반하여 개인정보를
      거래하는 내용의 정보 6의3. 총포ㆍ화약류(생명ㆍ신체에 위해를 끼칠 수 있는
      폭발력을 가진 물건을 포함한다)를 제조할 수 있는 방법이나 설계도 등의 정보
      {"\n"}{"\n"}7. 법령에 따라 분류된 비밀 등 국가기밀을 누설하는 내용의 정보 {"\n"}{"\n"}8.
      「국가보안법」에서 금지하는 행위를 수행하는 내용의 정보 {"\n"}{"\n"}9. 그 밖에 범죄를
      목적으로 하거나 교사(敎唆) 또는 방조하는 내용의 정보
      {"\n"}{"\n"}③ 고객이 발송한 메시지의 내용과 관련하여 수신자 또는 제3자가 회사에
      손해배상 등의 청구를 한 경우 고객은 회사를 면책시킬 책임이 있습니다.
      {"\n"}{"\n"}④ 고객은 수신자의 명시적인 수신거부의사에 반해서 일방적으로 전송
      또는 게시되는 영리목적의 광고성 정보를 전송함으로써 발생하는 모든
      민∙형사상의 책임을 부담합니다.
      {"\n"}{"\n"}
      <DoubleBold>제 7 조 (서비스 이용의 정지)</DoubleBold>
      {"\n"}{"\n"}① 회사는 고객이 다음 각 호에 해당할 경우 사전통지 없이 고객의 APP
      PUSH 서비스 이용을 정지할 수 있습니다.
      {"\n"}{"\n"}
      1. APP PUSH 서비스 유료 이용 고객이 이용요금을 체납한 경우(체납 3개월 경과
      시 고객의 어플리케이션 정보 및 푸시 알림 메시지 정보 등이 모두 삭제되며,
      복원되지 않습니다.) {"\n"}{"\n"}2. APP PUSH 서비스가 제공하는 API에 고객의
      어플리케이션 이용자들의 개인정보를 연동하는 경우(디바이스 식별자에
      이용자ID, 이용자명, 이용자 연락처 등의 개인정보 설정이 불가합니다.) {"\n"}{"\n"}3. APP
      PUSH 서비스 무료 이용 고객이 가입 후 3개월 이상 메시지를 발송하지 않는
      경우(고객의 어플리케이션 정보 및 푸시 알림 메시지 정보 등이 모두 삭제되며,
      복원되지 않습니다.) {"\n"}{"\n"}4. 회원 가입일로부터 1년이 초과되는 일자까지 유료
      서비스 전환이 안된 경우 고객의 어플리케이션이 삭제됩니다. (삭제 후 28일
      동안 어플리케이션의 데이터 삭제는 유예되고, 29일 이후에는 완전히 삭제되어
      복원되지 않습니다.)
      {"\n"}{"\n"}
      <DoubleBold>제 8 조 (전송 제한)</DoubleBold>
      {"\n"}{"\n"}① 회사는 고객이 전송한 메시지가 아래 각 호에 해당되는 경우 1개월
      동안의 기간을 정하여 고객의 APP PUSH 서비스 이용을 정지할 수 있습니다.
      {"\n"}{"\n"}
      1. 야간기간(당일 21시~익일 08시)에 사전 동의 없이 광고메시지를 전송하는
      경우 {"\n"}{"\n"}2. 광고메시지 전송 시, (광고)표시, 전송자의 명칭/수신동의철회
      방법(무료)등을 표시하지 않은 경우 {"\n"}{"\n"}3. 사전 수신동의를 받지 않은
      경우(수신동의 시 광고내용, 전송주기, 전송방법에 대한 충분한 고지가 있어야
      함) {"\n"}{"\n"}4. 법령에 의한 관계기관에서 불법 스팸 전송 사실을 확인하거나, 발신번호
      변작 등으로 판명되어 이용 정지를 요청하는 경우 {"\n"}{"\n"}5. 대량으로 스팸을 전송하여
      회사의 시스템에 장애를 야기했거나 야기할 우려가 있는 경우 {"\n"}{"\n"}6. 해당 광고를
      수신한 자가 수신거부를 요청하였으나 지속적으로 재전송한 경우
      {"\n"}{"\n"}② 고객이 전송한 메시지가 스팸 또는 불법 스팸이거나, 위법, 음란,
      선량한 풍속 기타 사회질서에 위반하는 사항을 내용으로 하는 경우 회사는 관련
      법령이 허용하는 범위 내에서 이의 전송을 즉시 차단할 수 있습니다.
      {"\n"}{"\n"}
      <DoubleBold>제 9 조 (데이터의 삭제)</DoubleBold>
      {"\n"}{"\n"}① 회사는 안정적이고 원활한 메시징 서비스 제공과 불필요한 비용
      발생으로 고객이 피해를 보지 않도록 고객이 운영하는 어플리케이션의 데이터를
      다음의 각 호의 경우에 한해 삭제할 수 있습니다.
      {"\n"}{"\n"}
      1. 고객의 어플리케이션에 6개월 이상 미접속한 이용자의 단말기 정보 {"\n"}{"\n"}2.
      고객의 어플리케이션을 삭제한 이용자의 단말기 정보 {"\n"}{"\n"}3. 6개월이 경과된 푸시
      발송 로그 {"\n"}{"\n"}4. 1년이 경과된 통계 데이터
      {"\n"}{"\n"}② 제1항 및 제2항의 경우 이용자가 어플리케이션을 재실행하거나,
      어플리케이션을 재설치 후 실행하면 단말기 정보가 다시 저장됩니다. 삭제되는
      단말기 정보의 종류는 다음 각 호와 같습니다.
      {"\n"}{"\n"}
      1. 푸시 토큰 {"\n"}2. 식별자 {"\n"}3. 푸시 수신 동의 및 광고 수신 동의 {"\n"}4. 앱 버전정보
      {"\n"}5. SDK 버전정보
      {"\n"}{"\n"}③ 제3항 및 제4항의 경우 해당 기간 경과 후 데이터는 모두 삭제되며,
      복원되지 않습니다.
      {"\n"}{"\n"}
      <DoubleBold>부칙</DoubleBold>
      {"\n"}{"\n"}본 약관은 2023년 5월 2일부터 적용됩니다.{"\n"}{"\n"}
    </Norm>
  );
};
